[
  "Have you ever tried an apple pie made with poison apples? It's to die for!",
  "If there's 1 thing I know I can count on, it's my hands.",
  "Laptop attempts to remove a hat, but states \"I.. can't get... it off!\"\n\nAn all in one machine sitting next to it replies \"Dude, that's because your caps\nlock is on\"\n\nSource: http://www.gocomics.com/theargylesweater/2016/02/05",
  "I never knew the gravity of throwing a ball really high into the air, but then\nit hit me.",
  "I tried to catch the fog, but I mist.",
  "Did you know that the dinosaurs celebrated the 4th of July? They only had it\nonce, because they played with dino-mite. You could say it started and ended\nwith a big bang.",
  "What did the colonists wear to the Boston Tea Party? Tea-Shirts",
  "Good thing we had wheels during the founding of the USA. We needed all the help\nwe could get with our revolution.",
  "If you neuter a cat, will it no longer have fur balls?",
  "Did you hear about the rapper that went bankrupt? I hear he doesn't even have 50\ncent to his name. Relevant: http://dab.im/2dwx6WM",
  "I saw a guy tumbling down a hill once. I just couldn't stop him, he was really\non a roll.",
  "I just want Autumn to leaf me alone. I'm not fall-ing for its tricks that the\nson is out. I'm inside because it's getting cold. Orange you glad the colors are\nchanging though?",
  "",
  "You might think that because you're a vegetarian, you can't wear leather. I\nassure you, your opinion can be suede.",
  "Why do people use puns to fight? Because they have a duel meaning.",
  "Do you look down on puns because they work on another level?",
  "I used to love puns as a kid, but then someone told me puns are bad. I guess,\nthat was the day I became a groan up.",
  "Becoming gluten free is really going against the grain. No more gluten means\nit's a wrap on sandwiches. Pasta la vista gluten. At yeast you can still eat\nbrown rice dough.",
  "Why doesn't a person who builds computers make a good parent? Because he makes\nhis own motherbored",
  "There's no 'i' in denial.",
  "Hard boiled eggs aren't all that they're cracked up to be. They don't yolk\naround!",
  "What do you call a thief who stole too much gold? Au-full.",
  "Did you know that the wheel used to be square? Then they started cutting corners\non production.",
  "I had a friend who would eat clocks for lunch. Eating with him was time\nconsuming.",
  "Does the name Pavlov ring a bell?",
  "Did you hear about the Spanish Train killer? He had locomotives.",
  "When your jokes are too good, and people sentence you to 2 years in a\npunitentiary.",
  "When you add too much salt to your food, your taste buds become assalted.",
  "Whiteboards are remarkable!",
  "Shovels were a ground breaking invention!",
  "Cemeteries are really popular right now. People are dying to get into them.",
  "Taking the elevator really has its ups and downs.",
  "The scarecrow was promoted, because he was outstanding in his field.",
  "The movie The Longest Yard, really has its pros and cons.",
  "It's handy, knowing sign language.",
  "The cashews were so salty, but they are sodium good.",
  "Mermaids wear Sea-shells because b-shells are too small.",
  "I tried eating my birthday dessert, but I got it all over me. I was caked.",
  "When things get turned on in the shower, she gets wet.",
  "I named my iPod the titanic, and now it's syncing.",
  "Do you know why there's no gambling in Africa? Because there's too many\ncheetahs.",
  "The invention of the broom really swept the world.",
  "Writing with a dull pencil is pointless.",
  "How do feet smell if they don't have a nose?",
  "What sea life doesn't help others? I'll give you a hint, they're crabby, and\nthey're shellfish.",
  "I don't have any change on me, but I do have a dollar bill. It's noncents.",
  "What did the Sober ghost say to his friends at the party? No Boo's for me\nthanks!",
  "I got canned from the orange juice factory because I wouldn't concentrate.",
  "What do you call a pile of cats? A meowton.",
  "Why doesn't anyone like jokes about German sausages? They're the Wurst.",
  "The past, present, and future all walk into a bar. It was tense.",
  "Why can't you run in camp grounds? You can only ran. It's past tents.",
  "What's a welder's favorite music genre to listen to?\n\nHeavy metal.",
  "Snow melting in the summer is Mother Nature liquidating her assets.",
  "Having phone sex might result in getting hearing aids.",
  "Picture of snakes on a 3D math plane. Source: \nhttps://i.chzbgr.com/full/3504429824/h1A501969/",
  "I ate a pencil once. I digested that sucker the old natural way. Yes, it was in\nfact a number 2 pencil.",
  "Picture of 2 peppers dressed up in winter attire. Captioned: \"Chili Peppers\".\nSource: http://www.gocomics.com/four-eyes/2013/11/25#.UpR_k6IAPJw.tumblr",
  "A picture of 4 figs captioned Fig. 1-4, with a title of \"Figs: A Diagram\"\nSource: http://gemmacorrell.tumblr.com/image/131965947648",
  "Did you know that diarrhea is hereditary? It runs in your genes.",
  "I ate four cans of alphabet soup yesterday. Then I had probably the biggest\nvowel movement ever.",
  "A girl's cat kidnapped her. It just whisker away.",
  "The crowd was confused by what the cat was doing. The cat then pawsed to explain\nit.",
  "The animal meowed for hours on end. It cat talk any other way.",
  "The cat didn't feel well after falling from the window. She's feline down.",
  "The cat made me sign the contract in blood. The proof is in the second claws!\nShould have read the tail end before hand.",
  "We shaved the cat yesterday. He's fur-ious.",
  "I escaped Iraq the only way I knew how, Iran.",
  "I got fired from the calendar factory. All I did was take a day off.",
  "What happened when the police found a peep hole into a nudist camp? They looked\ninto it.",
  "I once did a theatrical performance about puns. It was a play on words.",
  "How do you fix a train that can't hear? With an EnginEAR",
  "Did. Did. Did. Did. Did. Did. Did. Did. Did. Did.\n\nNo pun intendid.",
  "I tried to tell a series of jokes to my friend to see if I could get a reaction.\nNo pun in ten did.",
  "A neutron goes into a bar and asks the bartender, \"How much for a\nbeer?\" The bartender replies, \"For you, no charge.\"",
  "A proton walks into the bar and asks the bartender for a $150 bottle of whiskey.\nThe bartender asks if he's sure, and the proton responds \"I'm positive.\"",
  "A guy goes to a psychiatrist. \"I keep having these alternating\nrecurring dreams. First I'm a teepee, then I'm a canopy. Then I'm a\nteepee again, then I'm a canopy. What's wrong with me? I'm going crazy!\" The\ndoctor replies, \"It's very simple. Relax, you're two tents.\"",
  "I have a large collection of candy canes. They're all in mint condition.",
  "Being number 1 is odd.",
  "I only give away dead batteries; free of charge that is.",
  "My calculator is really something I can count on.",
  "The telemarketer respected peoples' privacy by putting his name on the neck of\nhis shirt. This way he'd have a collar id.",
  "Log backups are generally a good thing to have unless it's in the toilet.",
  "The best thing about Booleans is that even if you're wrong, you're only off by a\nbit.",
  "The best part about being a Web Browser is all the free cookies.",
  "I used to be very good with Microsoft Office. My skills Excel others'. I had a\ngreat Outlook on my skills until you stole it. I'll get it back though, you have\nmy Word.",
  "Do you cough so much that your coworkers won't let you cough at work? Need a\nplace to cough in? Buy a coffin!",
  "They say that the average doesn't always represent the data accurately. I guess\nit just doesn't mean much.",
  "Why are Assembly programmers always wet? They work below C level.",
  "Did you hear about the person who left the party early by throwing a package of\nhay at people? I guess you could say they baled.",
  "I knew a guy who's foot was a mile long. Trimming his toenails was a big feet.",
  "I knew a guy who lost everything below his left ankle. He was 1 foot shorter\nfrom then on.",
  "In the old west, artists would get in fights and settle them by seeing who could\npaint a gun first. I guess the winner was the one who drew a weapon faster.",
  "Whenever I get a picture taken of me, I'm always disposing saliva through my\nmouth. I guess that must just be a spitting image of me.",
  "The vet came back to tell me that my dog doesn't actually have an ear infection.\nMy only response was \"That's good to hear\".",
  "If two pigs start dirty dancing, is it called pork grind?",
  "If a large garbage can sinks in an ocean, attempting to retrieve it would be\nconsidered dumpster diving.",
  "The duck added the drinks to his bill.",
  "Being murdered is a deadly act.",
  "A coworker said that you can't have a growth mindset if you stick your head in\nthe sand. I simply told him that you can't grow if you don't have your roots\nplanted.",
  "Why did C++ reject C's proposal for going on a date? C has no class.",
  "Why do rabbits like drinking beer? It gives them hops.",
  "I used to create shirts and pants from fashion magazines. I had many articles of\nclothing.",
  "The guests at the wedding started crying when the cake came out because it was\nmade of tiers.",
  "I tried using chicken soup broth in a joke once. It was a laughingstock.",
  "Why did Pumba like Simba so much? Simba was his mane man.",
  "You think Geppetto can tell if Pinocchio is lying? Oh, he nose.",
  "Why does Simba never order delivery? It's easier to eat whatever is lion around.",
  "What's The Lion King full of? Simba-lism.",
  "What does Sully write with? Monster's Ink.",
  "What is Simba's favorite musical genre? Pride rock.",
  "Who was Jasmine attracted to? A-lad-in trouble.",
  "How can the Little Mermaid avoid all her problems under the sea? Go aerial.",
  "What did Ariel's father say when he was convincing people to do stuff? Try-tons.",
  "What do you say to someone trying to enter the Beast's castle? Ring the door,\nBelle.",
  "\"Walt, which part of your leg is hurting?\" Walt points to left kneecap \"Dis\nknee.\"",
  "My computer has an interstellar pub, it's a space bar.",
  "\"Mulan! How many enemies are on that ridge?\"\n\n\"I'm not sure... about a hun-dred?\"",
  "Does drinking fresh tea come at a steep price?",
  "The wise guy thought he'd fix things by turning on the lamp without a bulb. It\nwasn't very bright.",
  "Did you know that you can tell the gender of an ant by dropping it into water?\nIf it sinks its girl ant, if it floats its boy ant.",
  "I had a friend who adjusted bones for a living in Egypt. He was a Cairo-practor.",
  "You allergic to corn? No? Good I've got some corny jokes for you.",
  "I tried to understand why the guy was so large, but he was ambiguous",
  "Someone asked me a question about cutting down trees, but I was stumped. So I\nmade up an answer on a limb.",
  "I didn't think they'd mind that I overcooked their tortilla, but they told me we\nneeded to taco bout it.",
  "I really wanted a rare steak, but the waiter said he couldn't find a steak made\nof unicorn.",
  "For real though, with out steak, I'd have a cow.",
  "After some trouble, I managed to barter for some raw metal. It was an ore deal.",
  "What is blue and doesn't weigh very much? Light blue.",
  "What's brown and sticky? A stick.",
  "What has four wheels and flies? A garbage truck.",
  "What do you call a waffle lying on a beach in California? Sandy eggo.",
  "If you put root beer in a square glass, does it become beer?",
  "My friend tried smoking my todo list. He was high on my priorities.",
  "Smoking weed is a joint effort.",
  "Where does the dog go when it loses its tail? The retail store.",
  "How do dogs travel? By waggin'.",
  "When does the clock win? When it's one",
  "I put mint in my hot water. It's minty.",
  "If you hand someone mice as an accolade you are giving them preys.",
  "Did you know groups of fish have school everyday of the week?",
  "I used a large noodle costume to pose as someone else. Everyone knew I was\nimpasta.",
  "I thought I knew what type of pasta I wanted, but there's just so many\npastabilities",
  "Where do pencils go on vacation? Pencilvania.",
  "Can you imagine how much deeper the ocean would be if it weren't for sponges?",
  "The inventor of the knock knock joke received a no-bell-prize.",
  "Where would you go, if you were thirsty for a carbonated drink, but not that\nthirsty? Minisoda",
  "Image: Picture of a Koala with the caption: \"What do you mean I'm not a bear, I\nhave all of the koalifications\"",
  "Image of two tents across from each other, with a dog in each looking across\nfrom each other. The caption: \"this is an in tents stare down\"",
  "That person is booking it for the library!",
  "Friend: \"Orion's Belt is a big waist of stars.\"\nMe: \"Terrible joke. Only 3 stars\".\n\nhttps://twitter.com/techoglot/status/909537169995325441",
  "To argue against a fact, I used a ruler in my kitchen as a counter measure.",
  "I'm going to teach you to cook. Lettuce begin. First you pick your fish for the\nhalibut. Add some seasonings lightly, don't run out of thyme now!",
  "[In a courtroom] \"I hereby find you guilty of click-bait and sentence you to the\nelectric chair. What is about to happen next will shock you\"",
  "I started a business building boats. Sails are through the roof!",
  "If you wear cowboy clothes on a farm, are you ranch dressing?",
  "They say that no two people see colors the same way. Is color a pigment of your\nimagination?",
  "I got hit by someone with a door, following with \"you're pretty cute\". They\nliterally hit on me. I guess they must a door me.",
  "Have you ever tried cooking your meat over a nice, hot lava pit? I lava good\nBBQ.",
  "When coral gets stressed out, they die. Their most stressing topic? Current\nevents, though it comes in waves.",
  "The guy who had every lamp in his house stolen was delighted when it happened.",
  "Don't trust atoms, they make up everything.",
  "People told me that I'm addicted to drinking break fluid. I disagree. I can stop\nany time.",
  "Do I prefer boxers or briefs? Depends.",
  "My snail was too slow, so I took the shell off to make him faster. All it did\nwas make him sluggish.",
  "I saw a pirate with a steering wheel on his pants and I brought it to his\nattention. He simply responded \"Aye, it's driving me nuts!\"",
  "People keep making apocalypse jokes like there's no tomorrow.",
  "I went to a zoo with all dogs. It was a shitzu.",
  "Why did the feather, laying next to the brick, ignite? It was lighter.",
  "This half clogged vacuum cleaner sucks.",
  "You can't plant seeds if you haven't botany.",
  "Did you hear about the guy who tried to buy rollerblades for $0.50? I guess you\ncould say he was a cheapskate.",
  "I was asked if I wanted to try firing a shotgun. I guess I'll give it a shot.",
  "The midget never understood anything people said. I guess it went over their\nhead.",
  "A boomerang with computer RAM attached to it really brings back memories.",
  "I paid the judge a pile of hay to get out of jail. He accepted my bale payment.",
  "What is it called when a shrimp kills another? A krilling spree!",
  "Did you hear about the guy with no arms and his sandwich? He didn't make it.",
  "A day without sunshine is like, dark.",
  "Poop jokes aren't my favorite, but they are a solid number 2.",
  "The toilet in the poker addicted queen's bathroom has a deck of cards. There's\nalways a royal flush.",
  "Coffee isn't my cup of tea.",
  "Why did the golfer wear two pairs of socks? In case he got a hole in one.",
  "That guy had a lot of potential until I dropped him .",
  "The person who had a coffee cup thrown at them went to the police station to\nreport being mugged.",
  "Image: Picture of a phone screen, with a bullet from a gun sticking through it.\nA literal screenshot.\nSource: https://www.reddit.com/r/pics/comments/50i231/screenshot/",
  "The pickle had a good birthday. She really relished it.",
  "Did you hear about the birthday candle sale? It was a blow out!",
  "What kind of cake does Peter Pan eat for his birthday? A Pan-cake.",
  "Why did the person get heartburn after eating the cake? They ate the candles.",
  "Why doesn't a teddy bear eat cake on his birthday? He's stuffed.",
  "Why does nobody believe lazy cats? Because they're liars.",
  "Why did the bicycle fall over? It was two tired.",
  "I met a man who's name was Rob Bed. His identity must have been stolen.",
  "The army of laptops were all plugged in and ready to charge.",
  "In protest, I got a shirt with California and Texas on it. I was making a\nstate-ment.",
  "Why was the spring so nervous? Because it was wound tight!",
  "Why was the space rock tastier than the earth rock? It's a little meatier.",
  "I tried fishing once. I was hooked.",
  "The flooding usually happens in August but happened in July. It was a monthsoon.",
  "What did the Midget say to the Pirate? Look me Eye to Aye and say that again!",
  "I was thinking about buying this mirror for my room but was unsure if I liked\nit. I just needed to reflect on it for a bit.",
  "People were angry at me for being indecisive. I didn't know how to feel.",
  "I always had issues shredding cheese. However, I have grater problems to deal\nwith.",
  "My friend stole my pencil. A line was drawn that day.",
  "It's impossible to put this book on anti-gravity down.",
  "My teacher taught us hexagons today. I reported them because they were too edgy.",
  "The cashier at my favorite grocery store is always checking me out.",
  "The worker at the recycling plant was sad. It was soda pressing.",
  "What does the royal wall say when almost getting hit by a car while crossing the\nstreet in Brooklyn? \"Hey I'm wallking here!\"",
  "Electricians are always stripping to make their living.",
  "I don't know how I feel about loosing my mood ring...",
  "I got hit by a can of coke. It didn't hurt, it was a soft drink.",
  "Someone splashed vodka on me, which hurt because it was hard liquor.",
  "I attached watches end to end to make a belt. It was a waist of time.",
  "I couldn't understand the pony. He was a little hoarse.",
  "I can't believe the prices of natural gases. Helium keeps going up!",
  "How do you escape a giant whale after being eaten? You run until you're pooped\nout.",
  "My friend moved into a new house, so I bought them an elephant for their room.\nThey thanked me but I said \"Don't mention it\".",
  "Digging holes is boring.",
  "I rode a sheep out of town when I was wanted by the cops. I was on the lamb.",
  "Don't touch your eyes, they're only for looking.",
  "Why was the general not wearing any pants? He was debriefed.",
  "Why did the hipster burn their lip while drinking tea? They drank it before it\nwas cool.",
  "My friend wanted to buy a camouflage jacket, but I couldn't see them wearing it.",
  "Why do Chicken Coops only have 2 doors? If they had four doors, they'd be\nChicken Sedans.",
  "Why didn't the skeleton show up to the party? He didn't have the guts.",
  "I'm afraid of calculating the square root of 2. It's an irrational fear.",
  "The pumpkin carver is talented. They're very gourd at their job.",
  "Why did the policeman smell bad? He was in the line of duty.",
  "I got fired from the bank because I lost interest in my work.",
  "Why did the child start hitting their pancake? They preferred pound cake.",
  "She fashioned a music note out of a pebble. It became rock music.",
  "Telling jokes on an elevator is humor on different levels.",
  "Why did the young spider go to a coding boot camp? He wanted to become a web\ndeveloper.",
  "I tried using a tower made of squares and triangles to reach the sky, but\nfailed. I was out of shape.",
  "I wrote a joke on a piece of paper, but it was tearable.",
  "I built a horse home that withstood a storm. It's stable.",
  "I always invite the mushroom to the raves I go to. He's a fungi.",
  "Why was the bed tester being chased by cops? They were resisting a rest.",
  "I looked at the clocks at the horologist's store as I walked home. It was a good\nway to pass time.",
  "Why don't children TV shows allow talking ducks? They try to avoid fowl\nlanguage.",
  "I am always afraid of riding my horse in the dark, but she's a night mare.",
  "A bike keeps running me over every day. It's a vicious cycle.",
  "How do you throw a surprise party for the solar system? You planet!",
  "I removed the rear view mirror in my car. I haven't looked back since.",
  "After a strenuous poop, I was wiped.",
  "When it comes to wind  power I'm a big fan.",
  "I thought becoming a father would be easy, but without children it was not\napparent.",
  "I tried to use the dull knife, but it just didn't cut it.",
  "What is a cannibal's favorite to-go food? Finger food.",
  "We call bleach blondes suicide blondes. Dyed by their own hands.",
  "An American was speaking to a European about the weight of their dog and tried\nconverting from pounds to grams but struggled. There was mass confusion.",
  "Why didn't the library that converted to a hotel every succeed? They were\nbooked.",
  "I carved a guitar pick out of a boulder. It is used for rock music.",
  "Are ants with male genitalia called uncles?",
  "How do you create holy water? You boil the hell out of it.",
  "Using a whistle blows.",
  "I bought a whistle made out of a tree but had to return it. It wooden whistle!",
  "I bought a parrot yesterday. The reason? Speaks for itself!",
  "Why is painting a dangerous hobby? You have a lot of strokes.",
  "I imagine using the sun for solar energy is a bright idea. I can't see it\nhappening though.",
  "Why were the traveling wanderers always happy? They were nomads.",
  "Why did the airplane pilot fail to land safely? He learned to fly by taking a\ncrash course.",
  "I get aroused by car keys when I use them to start my car. Such a turn on.",
  "If Britain left the EU, how much space would be freed up? 1 GB.",
  "How much do pirates pay for corn? A buck n ear.",
  "Why was river rich? It had many banks",
  "When a toad dies, it croaks.",
  "If you don't understand the importance of looking at a black hole, you don't\nunderstand the gravity of the situation.",
  "What's a pianist's favorite sandwich? A Tune-a Sandwich.",
  "Smoking kills. Bacon kills. Smoking bacon cures it.",
  "When a wheel deflates on your car. You retire.",
  "Two guys are on a boat with three cigarettes and nothing to light them with.\nThey threw one overboard and the boat is now a cigarette lighter.",
  "I prefer lanterns over long books. I'm a fan of light reading.",
  "Why don't ants get sick? They have little anty bodies.",
  "Inventing the number zero took no effort. It was nothing.",
  "Why did the bank teller push over an old lady? Because she wanted to check her\nbalance.",
  "My best friend lived in the house boat next door. We eventually drifted apart\nthough.",
  "A string walks into a bar and the bartender says \"We don't serve your kind\nhere.\" The string walks out, torn about what happened. He becomes so upset he\nbecomes tied up with the idea of it. The string returns to the bar to confront\nthe bartender and the bartender asks \"Didn't I already kick you out?\" The string\nreplied \"I'm a frayed knot.\"",
  "A construction worker was taken to court by his boss for putting his hands in\nwet pavement. His boss won because he had concrete evidence. It really cemented\nthe case.",
  "A person was building the frame house when their boss came by and told them how\nto properly build it. It was constructive criticism.",
  "Don't ever become friends with a mountaineer. Things tend to get rocky. It's a\nrough relationship to say the least.",
  "A cow that can't produce milk is an udder failure.",
  "I hire waiters for all of my business meetings. They bring a lot to the table.",
  "There is a joke about a tall wall, but you won't get it, it just goes over your\nhead. I'm still trying to get over it.",
  "A termite walks into a bar and asks \"Is the bar tender here?\"",
  "A Roman walks into a bar and holds up 2 fingers and says \"I'd like five beers\nplease.\"",
  "Never try to argue with a guitarist. They always strike a chord.",
  "Have you seen the scenery on the moon? It's out of this world.",
  "Why is bread so lazy? It just loafs around.",
  "I went to the zoo and saw an area with a bunch of loaves of bread in it. A sign\nabove read \"Bread in captivity.\"",
  "A friend was pulling around a loaf of bread on a leash. \"Nice dog!\" I exclaimed.\n\"Thanks\", said my friend \"It's a pure-bread.\"",
  "What's the best way to teach a dog to shake hands? Pawsitive reinforcement.",
  "Why is it a bad thing for people with stutters to go to prison? They can never\nfinish a sentence.",
  "Urine is gender fluid.",
  "Sundials can only be used by male children. If female children used them they'd\nbe called daughterdials.",
  "Why were the thieves putting their stolen cash with their dirty clothes at the\nlaundry cleaners? They thought that's how you launder money.",
  "What's the difference between a dogwood and a pine tree? The bark.",
  "What key do cows sing? Beef flat.",
  "What do you call a cow that can play a musical instrument? A Moo-sician.",
  "Why doesn't Beethoven like chickens? All they ask for is \"Bach, Bach Bach\"",
  "What happens when you drop a piano down a mineshaft? A-flat miner.",
  "What's a balloon's least favorite music genre? Pop music.",
  "What's a cow's least favorite material for building homes with? Cottage cheese.",
  "Why do people with crossed eyes have difficulty keeping relationships? They\ncan't help seeing other people on the side.",
  "Where does captain hook buy his replacement hooks?  At the second hand store.",
  "What do you call a coder who understands the importance of proper spelling? A\npro-grammar.",
  "What is Uncle Sam's favorite snack? Fire-crackers!",
  "Where does a sick boat go to feel better? To the dock.",
  "If you boil the funny bone, it becomes a laughing stock. That's humerus.",
  "Records are groovy.",
  "It is striking the similarities between baseball and bowling.",
  "Where do married women who drink tea slowly live? Mississippi.",
  "What's the difference between a literalist and a kleptomaniac? A literalist will\ntake everything literally. A kleptomaniac will take everything, literally.",
  "I used to be mad at the ground but I forgave them. It is all under me now.",
  "Being married has a nice ring to it.",
  "Swords were cutting edge when they were invented.",
  "Working at a cemetery is fine as long as you don't get buried in your work.",
  "An eating utensil with 4 prongs is a fork. If it only has 3 prongs, it's a\nthreek.",
  "I'm always confused until someone sheds light on something. That's why without\nthe sun, I'd be in the dark.",
  "What's a chiropractor's favorite genre of music? Hip-pop.",
  "I took a picture of a garbage truck but had to delete it. It was too trashy.",
  "I tried to tell a joke about separating your garbage, but they heard it before.\nThe joke was recycled.",
  "I tried to go up hill but fell back down. The potential was there but it went\ndown hill.",
  "I wore pants made out of a hive where bees lived. It gave me a nice beehind.",
  "A group of crows is called a murder. Well, only if there's probably caws. Only\none or two crows is attempted murder. If you have a group of crows at church,\nit's a mass murder. If you have a group of crows and ducks together, you call it\na murder most fowl that's not what it's quacked up to be.",
  "I took a picture of a bear once. It was grizzly.",
  "I tried to construct my favorite forest animal from paper mache but required a\nlot of help. I bearly made it.",
  "I made my own potato chips in the shapes of 1, 2, and 3. It required me to\ncrunch the numbers.",
  "If someone is unhappy just throw a lamp at them to get them to lighten up.",
  "Geology rocks!",
  "Someone finally told me my first 4th dimension joke today. It was about time.",
  "The newest smart phones, with screens that cover almost all of the front, are\nreally top notch!",
  "Inventing cement really paved the way we build things and I have mixed feeling\nabout that.",
  "My terrible cellphone reception is the worst at home. Bar none.",
  "I asked my friend to proof read my paper but all they did was made fun of it.\nI'll get what I wanted. Mark my words.",
  "I tried working as a tailor, but I just wasn't suited for the job.",
  "I used to work at a muffler factory, but it was exhausting.",
  "I tried being a doctor, but I didn't have the patience.",
  "I tried being a barber, I just couldn't cut it.",
  "I used to work as a historian, I just couldn't see a future with it.",
  "Unsure of my future, I considered making mirrors for a living. That's something\nI can see myself doing.",
  "Being unemployed, I'm looking into being an optometrist.",
  "I attempted to be a body builder, I just wasn't a good fit. It didn't work out.",
  "Being a dentist and trying to motivate yourself to go in every day is like\npulling teeth.",
  "They all laughed when I said I was going to be a comedian. Well, nobody's\nlaughing now!",
  "I tried working as a chiropractor. I quit because it was back breaking.",
  "If you knead dough, you could get a job as a baker.",
  "I got fired from being a surgeon. I couldn't cut it.",
  "I found a passion working as an electrician, which was shocking.",
  "I got fired from my job as a clairvoyant. I didn't see it coming!",
  "I tried becoming a pilot, but that never got off the ground.",
  "I got fired as a mechanic because I took too many breaks.",
  "I tried emptying out water from a bottle as a joke. It was a pour attempt at\nhumor.",
  "What do you call an encouraging sith lord? A moti-Vader.",
  "What did the band the Black Eyed Peas say after going to the dentist?  🎶🎵 I've\ngot a filling! 🎶🎵",
  "What do professional runners eat before a race? Fast food.",
  "What do you call an acid that's a jerk? Amino acid.",
  "I recharged a battery I found in the garbage. It was re-volting.",
  "Apparently I was accused of plagiarism. Their words, not mine.",
  "Working in the funeral industry is a dying business.",
  "Being in the window repair business can be pane-full.",
  "What do you call a Roman warrior who is always happy? A gladiator.",
  "I fought my friend for the wishbone. We might have gone too far when things\nsnapped.",
  "What's a turkey's favorite song? \"All about that baste\"",
  "Why didn't the Pilgrims wear hats for Thanksgiving? They had to loosen their\nbuckles to make room for seconds!",
  "The ability to draw a perfect circle requires being well rounded.",
  "Why wasn't the Java developer able to read any of their code? Because they\ndidn't C#.",
  "Why do skeletons like piano stores? It's where they buy their organs!",
  "What do you call a giant ship built out of beer cans? A boose cruise.",
  "People always tell me to get off my high horse. To that I say, neigh!",
  "I don't trust umbrellas. They're kind of shady",
  "A clown held the door for me while walking into the store. It was a nice jester.",
  "Why do weed smokers smoke on ladders? That's how they can get a higher high.",
  "Why don't angels ever prepare for anything? They can just wing it.",
  "A radio network operator held a wedding. I heard the reception was amazing.",
  "I like to kiss flowers. I use tulips.",
  "Are you a candy bar? You're pretty sweet.",
  "Is your refrigerator running? You better go catch it!",
  "Why do rocks have the munchies? They're always stoned.",
  "Train operators really have their life on track.",
  "The person who invented the monorail must have had a one track mind.",
  " My friends didn’t understand my reaction when I declined going to a baby\nshower.  It’s because I only use full size showers.",
  "Being good at reading Braille is easy once you get a feel for it.",
  "Why is everyone afraid of ice cream? It  gives them the chills.",
  "Deja moo, the feeling you've heard that bull before",
  "I got an award for being the best at keeping secrets. I can't tell you how much\nit means to me.",
  "Going out of business as a statue artist is really hitting rock bottom.",
  "I don't understand why waiters always want to box my leftovers. I'd rather eat\nthem.",
  "Telling bad puns is how eye roll.",
  "People with celiac disease that eat bread are really gluten for punishment.",
  "Why are cats so good at baking? They are natural whiskers.",
  "I prefer buying all my music as vinyl records. It's very much a sound choice.",
  " Figuring out a seatbelt on an airplane is difficult at first until it clicks.",
  "As an interior designer, I tend to not look at what kind of window treatments I\nbuy. I always buy blind.",
  "What shoes do quiet hide and seek champions wear? Sneakers.",
  "I got a career through learning lock picking. It's opened up so many doors.",
  "Is it easy being not negative? |Absolutely|!",
  "How do morticians make money? They urn it.",
  "Dying at the age of 101 would be dying at your prime.",
  "A barista was wearing a face mask while making my drink. I asked \"Where'd you\nfind face masks? They're all sold out.\" The barista replied, \"This is a coughy\nfilter.\"",
  "How do porcupines recover from the flu? NyQuill.",
  "How does a flu become viral? From influenzas.",
  "When you have a cold, getting the flu shot won't work compared to getting\nantibiotics. Guns aren't effective against the flu.\"",
  "The flu can be just as stressful as COVID-19. It's just a different kind of\nstrain.",
  "People who don't get flu shots make me sick.",
  "Why don't they eat steaks on Star Wars? It's always Chewie.",
  "With all the sales, the inventor of hand sanitizer must really be rubbing it in\nthese days.",
  "Making fun of the Corona virus is a sick joke.",
  "What does a painter do when they get cold? Put on another coat.",
  "What do you do when you get cold in your room? Stand in the corner because it's\n90 degrees.",
  "What rank do you give someone with a cold? Hanker Chief.",
  "My physicist friend always tells inappropriate jokes about the 5th dimension.\nIt's never the time or place.",
  "What happens when a snowman throws a temper tantrum? It has a meltdown.",
  "The Tower of Pisa is considered minimalist art, it's very lean.",
  "What does a thesaurus eat for breakfast? A synonym roll.",
  "What do you call a dinosaur that knows a lot of words? A Thesaurus.",
  "If the population of Ireland grew twice it's size, it would be Dublin in size.",
  "I am fairly accurate at guessing if you have bad posture. It's always based on a\nhunch.",
  "I suspected my neighbor would throw extra dirt in my garden. When I confronted\nthem, they just shrugged. The plot thickens...",
  "My friend sent me a postcard with a pun on it. I didn't get it.",
  "What do you call a broken frisbee? A friswas.",
  "Driving a garbage truck means you're a rubbish driver.",
  "What do you say when you accidentally walk in on God on the toilet? \"Holy crap!\"",
  "I tried becoming a recruiter for a hide and go seek league, but good players are\nhard to find.",
  "What is the kind of news you read from a tombstone? Grave news.",
  "I an avid investor in stocks. Chicken and beef are my forte. I have enough\nstocks to be considered a bouillionaire.",
  "Why can't lions ever be humble? They don't want to swallow their pride.",
  "What do you call a cow that's been shot? Holy cow!",
  "When do cars stop being cars? When they turn into a driveway.",
  "Most chairs are satin.",
  "What happens when a chemist passes away? You barium.",
  "I got in an argument with a mime. He did some unspeakable things.",
  "How do trees get on the internet? They log on.",
  "A librarian was helping a pregnant lady check out books. The librarian asked the\npregnant lady when she was due. The pregnant lady said that her baby doesn't\nbelong to the library.",
  "What do you call a donkey that rolls around hauling dirt? wheelburro.",
  "When my girlfriend dropped the last of the pizza, I was floored.",
  "I got fired from my job at the keyboard factory. I wasn't putting in enough\nshifts.",
  "Geology rocks, but geography is where it's at.",
  "If time is money, aren't ATMs time machines?",
  "An explosion at the cheese factory bleu up everything. De brie was everywhere.\nThe cause was due to the old building. It was destroyed fromage. Shredded to\nbits. The walls looked like swiss cheese.",
  "I was trying to think of a sodium joke, but Na, I couldn't think of one.",
  "Why don't skeletons get annoyed? They are unable to let anything get under their\nskin.",
  "Why can't ghosts go trick or treating with friends? They have no body to go\nwith.",
  "I thought about being a financial advisor. With my background in money, it makes\na lot of cents.",
  "Penguins don't like visiting Great Britain because they're afraid of Wales",
  "What does a newborn computer call its father? Data.",
  "I store all my dad jokes in a dad-a-base.",
  "Did you hear about the English teacher that went to jail? It was an incomplete\nsentence.",
  "The least interesting animal has to be the boar.",
  "What kind of crime does a coffee report to the police? A mugging.",
  "What do you call a bear with no teeth? Gummy bear.",
  "Why do doctors like hitting patients' knees? They get a real quick out of it.",
  "What state does the most laundry? Washington.",
  "A passerby just tossed an empty milk carton at me. How dairy?!",
  "My friend was using their telekinetic powers to do math on an abacus. They\noffered me a turn but I declined. It's the thought that counts.",
  "How do you make water beds bouncier? Add some spring water.",
  "My wife thinks our neighbor needs to stop sunbathing topless. Personally, I'm on\nthe fence.",
  "A pie in the Bahamas costs about $4 per pie, but that's because they're stolen.\nThat's the pie rate of the Caribbean.",
  "There used to only be 25  letters in the  alphabet. Nobody knows y.",
  "What does a clock do when it's still hungry? It goes back four seconds.",
  "Organic chemistry is difficult. Those who study it have alkynes of trouble.",
  "What's an Owl's favorite TV Show? Doctor Who, because it's a hoot.",
  "I spent many years doing limo repairs. After all that time, I've got nothing to\nchauffeur it.",
  "When I moved out into my own apartment, I hung up a copy of the US Constitution.\nI call it my declaration of independence.",
  "I try to make cheesy puns, but everyone I know is laughtose intolerant.",
  "What do you get if you cross a bike and a rose? Bicycle Petals!",
  "How do billboards know what to display? They communicate in sign language.",
  "I'm always getting yelled at for being lazy. I don't understand why. It's not\nlike I did anything.",
  "Why is your 32nd birthday always the shortest? Because it's only 30 seconds.",
  "I told my suitcases that there will be no vacation this year.  Now I’m dealing\nwith emotional baggage.",
  "I told my dentist that I think I had a toothache. They told me it was all in my\nhead.",
  "Why do boats float? They give into pier pressure.",
  "I never wear Velcro shoes. They're a rip-off.",
  "How do you treat a sick alligator? By giving it gator-aid.",
  "Why did the cookie go to the doctor? Because it felt crummy.",
  "I wonder when the very first Dalmatian was spotted?",
  "Why don't you see many cows working at leather factories? That's just how cows\nhide.",
  "My first time in an elevator was an uplifting experience. The second time, it\nreally let me down.",
  "Do you know how a book gets to be so think? It’s a long story.",
  "I've got a sinking feeling that I'm in quick sand...",
  "Why don’t gate builders have any enemies? Because they always mend fences.",
  "A SQL query walks into a bar, approaches 2 tables, and asks \"Can I join you?\"",
  "What do they serve at birthday parties in heaven? Angel food cake.",
  "What can a whole apple do that a half apple can't do? It can look round.",
  "6:30 is the best time on the clock. Hands down.",
  "How do clouds alleviate an itch? They find the nearest sky scraper.",
  "Why do you only get photos of teeth after a meal? That's the only time you get\ntooth pics!",
  "Mountains aren't just funny. They're hill-areas.",
  "Making a typo on a headstone could be a grave mistake.",
  "What are a linguist's favorite shoe to wear? Converse.",
  "I put a facemask on a chicken to protect it from COVID-19. It isn't perfect, but\nit fits the bill.",
  "What super power do parents have? Supervision.",
  "Why do future seers always have a lot of money? It's all about the profit.",
  "Where does ground beef go to dance? The meatball!",
  "I went to a smoke shop only to find it was replaced by an apparel store.\nClothes, but no cigar.",
  "I went bought a dozen bees from a beekeeper. I looked and saw I had 13 bees.\nApparently it was a freebee.",
  "What do you call a fun babysitting Owl? A hoot-nanny",
  "Why are ghosts bad liars? Because you can see right through them.",
  "Why are triangles always so agreeable? Because you can always see their point.",
  "Did you know locks will unlock with your voice? That's because communication is\nkey.",
  "I have the oldest living pet in the world. His name is Peeve.",
  "Where do fashionable ghosts shop? At the boo-tique.",
  "Why is it amazing that pumpkins are around on Halloween. They're usually flat\nfrom being squashed.",
  "How do you repair smashed pumpkins? With a pumpkin patch!",
  "If you don't pay for your exorcism, will you be repossessed?",
  "What kind of street does a ghost like the best? A dead end.",
  "Why did the haunted house dislike storms? Rain dampens its spirits.",
  "What's the biggest pan in the world? Japan.",
  "What kind of fish helps you hear better? A herring aid.",
  "Do you know what the reaction sounds like when potassium comes into contact with\noxygen? OK.",
  "I was a member of a top secret cooking society until I spilled the beans.",
  "My friend makes a million dollars a day. He works at the mint.",
  "Why are weightlifting competitions only held on Saturday and Sunday? The other\ndays of the week are weakdays.",
  "My landlord constantly complains about feeling inadequate. It must be the\ncomplex he has.",
  "What's the best way to see how long you sleep? By bringing a ruler to bed with\nyou.",
  "Which is smarter, longitude or latitude? Longitude, because it has 360 degrees.",
  "Chemists are great problem solvers because they always have solutions.",
  "My friend fell into an upholstery machine. He was recovered.",
  "I'd tell you a construction joke, but I'm still working on it.",
  "I stayed up all night because I couldn't figure out where the sun had gone. Then\nit dawned on me.",
  "I tried to solve a problem by flipping a coin, but it was a toss-up.",
  "What is a missionary's favorite type of car? A convertible.",
  "When I'm sad, I like to make pork roast. This gives me a shoulder to cry on.",
  "Last I time I took a bath I got a sunburn. Last time I try sunbathing!",
  "Why are owls who lose their voice such rebels? They don't give a hoot.",
  "Why are secret agents always so well rested? Because they're always undercover.",
  "I don't understand odorless gas. They don't make scents.",
  "Which planet does a circus travel from? Saturn, because it has 3 rings.",
  "What country is it obvious that you're no longer there? Uganda.",
  "Why was the Math textbook at the psychiatrist? Because it has a lot of problems\nthat need to be worked out.",
  "Plateaus are the highest form of flattery.",
  "One day, I was feeling down and my friend said \"It could be worse. You could be\nstuck underground in a hole full of water.\" I think he meant well.",
  "A doctor who likes to audition for roles in a play broke his foot. Luckily he\nstill made the cast.",
  "Why can't dogs get MRIs? Only CAT scan!",
  "I have a pet who loves to float and signal boats in the water. He's a good buoy.",
  "Why are water droplets at high elevations tastier than at sea level? Because\nit's Mountain Dew.",
  "When do astronauts eat? At launch time!",
  "Why did the female deer need to take out a loan? She wanted a few bucks.",
  "Why do actors love their job so much? It's all play.",
  "Why do the nuclear scientists always have spouses? Because they're just so\nradiant!",
  "My waffle maker made tiny waffle cars. It's the only time I enjoyed a traffic\njam.",
  "I've never hunted bear, but I have been fishing in shorts.",
  "Where's a fortune teller's favorite place to take a vacation? Palm Beach.",
  "The cost to lift a house with balloons will go Up with inflation.",
  "I used to work at a shoe factory but got fired because I didn't put any soul\ninto my work.",
  "I wanted to use my friend's trampoline but they told me to bounce.",
  "What  computer is really good at singing? A Dell.",
  "Why do Farmers like dubstep?  They love it when the beet drops.",
  "My doctor prescribed me an ointment for my skin spots but he wouldn't make any\nrash promises.",
  "I don't trust any acupuncturists. They're all backstabbers.",
  "How can art dealers afford their rent? With Monet.",
  "My favorite song is played on the 50MHz frequency. You've never heard it before.",
  "I'll never sell things to cabinet makers. They're all counter fitters.",
  "My friends go with me when we try new foods. They're my taste buds.",
  "What should a good lawyer wear to court? A proper lawsuit.",
  "I tend to believe anything oranges say because they have a tang of truth to\nthem.",
  "I got a job as a garbage man, but didn't have any training. I picked it up as I\nwent along.",
  "I accidentally swallowed food coloring. The doctor says I'm fine but I feel like\nI'm dyeing inside.",
  "I was afraid of speed bumps, but I'm slowly getting over it.",
  "Why did Karl Marx fail his grammar class in school? He couldn't capitalize.",
  "Why do bunnies get mad when they're covered in warm blankets? They always become\nhot cross bunnies.",
  "I saw an improv show the other day starring mimes. The performance and show was\nspectacular, but that goes without saying.",
  "What do you call a protagonist with abnormally good hearing? A Super Hearo.",
  "What kind of bagels fly? A plain bagel!",
  "I have a friend who's very rich. It's from all the fortune cookies they ate.",
  "I dumped a bucket of red paint on someone I thought was wearing a fur jacket.\nThey weren't. I really mis-red the situation.",
  "A well developed joke always has a photo finish.",
  "What's the difference between a hippo and a Zippo? One is really heavy and the\nother is a little lighter.",
  "Why do cats like bread? So they can loaf around the house.",
  "I have twin daughters. One's name is Kate, the other, Duplikate.",
  "I find if I get tired from running, I just have to stop running behind cars.\nIt's exhausting.",
  "Why can't a nose be 12 inches long? Because then it'd be a foot!",
  "Don't believe everything you see at the Oscars. Everyone is a paid actor."
]
